<a href="https://colab.research.google.com/github/aasim-syed/10-projects-10-hours/blob/master/ChiSquare.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv(r'C:\Downloads\mtcars.csv')

In [ ]:
print(df)

                  model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  \
0             Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1
1         Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1
2            Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1
3        Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0
4     Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0
5               Valiant  18.1    6  225.0  105  2.76  3.460  20.22   1   0
6            Duster 360  14.3    8  360.0  245  3.21  3.570  15.84   0   0
7             Merc 240D  24.4    4  146.7   62  3.69  3.190  20.00   1   0
8              Merc 230  22.8    4  140.8   95  3.92  3.150  22.90   1   0
9              Merc 280  19.2    6  167.6  123  3.92  3.440  18.30   1   0
10            Merc 280C  17.8    6  167.6  123  3.92  3.440  18.90   1   0
11           Merc 450SE  16.4    8  275.8  180  3.07  4.070  17.40   0   0
12           Merc 450SL  17.3    8  275.8  180  3.07  3.730  17.60   0   0
13          Merc 450SLC  15.2    8  275.8  180  3.07  3.780  18.00   0   0
14   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0
15  Lincoln Continental  10.4    8  460.0  215  3.00  5.424  17.82   0   0
16    Chrysler Imperial  14.7    8  440.0  230  3.23  5.345  17.42   0   0
17             Fiat 128  32.4    4   78.7   66  4.08  2.200  19.47   1   1
18          Honda Civic  30.4    4   75.7   52  4.93  1.615  18.52   1   1
19       Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1
20        Toyota Corona  21.5    4  120.1   97  3.70  2.465  20.01   1   0
21     Dodge Challenger  15.5    8  318.0  150  2.76  3.520  16.87   0   0
22          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0
23           Camaro Z28  13.3    8  350.0  245  3.73  3.840  15.41   0   0
24     Pontiac Firebird  19.2    8  400.0  175  3.08  3.845  17.05   0   0
25            Fiat X1-9  27.3    4   79.0   66  4.08  1.935  18.90   1   1
26        Porsche 914-2  26.0    4  120.3   91  4.43  2.140  16.70   0   1
27         Lotus Europa  30.4    4   95.1  113  3.77  1.513  16.90   1   1
28       Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.50   0   1
29         Ferrari Dino  19.7    6  145.0  175  3.62  2.770  15.50   0   1
30        Maserati Bora  15.0    8  301.0  335  3.54  3.570  14.60   0   1
31           Volvo 142E  21.4    4  121.0  109  4.11  2.780  18.60   1   1

    gear  carb
0      4     4
1      4     4
2      4     1
3      3     1
4      3     2
5      3     1
6      3     4
7      4     2
8      4     2
9      4     4
10     4     4
11     3     3
12     3     3
13     3     3
14     3     4
15     3     4
16     3     4
17     4     1
18     4     2
19     4     1
20     3     1
21     3     2
22     3     2
23     3     4
24     3     2
25     4     1
26     5     2
27     5     2
28     5     4
29     5     6
30     5     8
31     4     2

In [ ]:
df1=df[['cyl','carb']]

In [ ]:
df1

    cyl  carb
0     6     4
1     6     4
2     4     1
3     6     1
4     8     2
5     6     1
6     8     4
7     4     2
8     4     2
9     6     4
10    6     4
11    8     3
12    8     3
13    8     3
14    8     4
15    8     4
16    8     4
17    4     1
18    4     2
19    4     1
20    4     1
21    8     2
22    8     2
23    8     4
24    8     2
25    4     1
26    4     2
27    4     2
28    8     4
29    6     6
30    8     8
31    4     2

In [ ]:
df1=df1.head(3)

In [ ]:
df1

   cyl  carb
0    6     4
1    6     4
2    4     1

In [ ]:
chi2_contingency(df1)

(0.6944444444444444,
 0.7066482778577161,
 2,
 array([[6.4, 3.6],
        [6.4, 3.6],
        [3.2, 1.8]]))

In [ ]:
survey=pd.read_csv(r'C:\Datasets\survey.csv')

In [ ]:
survey

,Sex,Wr.Hnd,NW.Hnd,W.Hnd,Fold,Pulse,Clap,Exer,Smoke,Height,M.I,Age
0,Female,18.5,18.0,Right,R on L,92.0,Left,Some,Never,173.0,Metric,18.250
1,Male,19.5,20.5,Left,R on L,104.0,Left,None,Regul,177.8,Imperial,17.583
2,Male,18.0,13.3,Right,L on R,87.0,Neither,None,Occas,NaN,NaN,16.917
3,Male,18.8,18.9,Right,R on L,NaN,Neither,None,Never,160.0,Metric,20.333
4,Male,20.0,20.0,Right,Neither,35.0,Right,Some,Never,165.0,Metric,23.667
...,...,...,...,...,...,...,...,...,...,...,...,...
232,Female,18.0,18.0,Right,L on R,85.0,Right,Some,Never,165.1,Imperial,17.667
233,Female,18.5,18.0,Right,L on R,88.0,Right,Some,Never,160.0,Metric,16.917
234,Female,17.5,16.5,Right,R on L,NaN,Right,Some,Never,170.0,Metric,18.583
235,Male,21.0,21.5,Right,R on L,90.0,Right,Some,Never,183.0,Metric,17.167
236,Female,17.6,17.3,Right,R on L,85.0,Right,Freq,Never,168.5,Metric,17.750

In [ ]:
ext=survey[['Exer','Smoke']]

In [ ]:
ext

     Exer  Smoke
0    Some  Never
1    None  Regul
2    None  Occas
3    None  Never
4    Some  Never
..    ...    ...
232  Some  Never
233  Some  Never
234  Some  Never
235  Some  Never
236  Freq  Never

[237 rows x 2 columns]

In [ ]:
ext['Exer']=[0 if (Exer=="None") else 1 if (Exer=="Some") else 2 for Exer in ext['Exer']]

D:\STUDIES\ANACONDA\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
ext['Exer']

0      1
1      0
2      0
3      0
4      1
      ..
232    1
233    1
234    1
235    1
236    2
Name: Exer, Length: 237, dtype: int64

In [ ]:
ext['Smoke']=[0 if (Smoke=="Never") else 1 if (Smoke=="Occas") else 2 for Smoke in ext['Smoke']]

D:\STUDIES\ANACONDA\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
ext

     Exer  Smoke
0       1      0
1       0      2
2       0      1
3       0      0
4       1      0
..    ...    ...
232     1      0
233     1      0
234     1      0
235     1      0
236     2      0

[237 rows x 2 columns]

In [ ]:
test=ext[['Exer','Smoke']]

In [ ]:
test=test.head(3)

In [ ]:
test

   Exer  Smoke
0     1      0
1     0      2
2     0      1

In [ ]:
stat, p, dof, expected = chi2_contingency(test)

In [ ]:
p

0.1353352832366127

In [ ]:
alpha = 0.05
if p <= alpha:
    print('Dependent')
else:
    print('Independent')

Independent

In [ ]:
test

   Exer  Smoke
0     1      0
1     0      2
2     0      1

In [ ]:
colTotal=[sum(test['Exer']),sum(test['Smoke'])]

In [ ]:
colTotal

[1, 3]

In [ ]:
rowTotal=[sum(test.iloc[0]),sum(test.iloc[1]),sum(test.iloc[2])]

In [ ]:
rowTotal

[1, 2, 1]

In [ ]:
(rowTotal[1]*colTotal[0])/sum(rowTotal)

0.5

In [ ]:
Expected=[(rowTotal[0]*colTotal[0])/sum(rowTotal),(rowTotal[1]*colTotal[0])/sum(rowTotal),(rowTotal[2]*colTotal[0])/sum(rowTotal),(rowTotal[0]*colTotal[1])/sum(rowTotal),(rowTotal[1]*colTotal[1])/sum(rowTotal),(rowTotal[2]*colTotal[1])/sum(rowTotal)]

In [ ]:
Expected

[0.25, 0.5, 0.25, 0.75, 1.5, 0.75]

In [ ]:
test.iloc[0]['Exer']

1

In [ ]:
(test.iloc[0]['Exer']-Expected[0])**2/Expected[0]

2.25

In [ ]:
stat

4.0

In [ ]:
expected

array([[0.25, 0.75],
       [0.5 , 1.5 ],
       [0.25, 0.75]])

In [ ]:
x=[((test.iloc[0]['Exer']-Expected[0])**2/Expected[0]),((test.iloc[1]['Exer']-Expected[1])**2/Expected[1]),((test.iloc[2]['Exer']-Expected[2])**2/Expected[2]),((test.iloc[0]['Smoke']-Expected[3])**2/Expected[3]),((test.iloc[1]['Smoke']-Expected[4])**2/Expected[4]),((test.iloc[2]['Smoke']-Expected[5])**2/Expected[5])]

In [ ]:
x

[2.25, 0.5, 0.25, 0.75, 0.16666666666666666, 0.08333333333333333]

In [ ]:
sum(x)

4.0